loc  and iloc  
loc → label-based indexing (you use row/column names)

iloc → integer-based indexing (you use row/column positions)

In [3]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David"],
    "age": [25, 30, 35, 40],
    "city": ["London", "Paris", "Berlin", "Rome"]
}, index=["a", "b", "c", "d"])

In [6]:
print(df)

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40    Rome

In [10]:
df.loc[["b"]]

  name  age   city
b  Bob   30  Paris

In [13]:
df.loc[["a","c"]]

      name  age    city
a    Alice   25  London
c  Charlie   35  Berlin

In [19]:
df.loc["a","city"]

'London'

In [25]:
df.loc[["a","c"],["name","city"]]

      name    city
a    Alice  London
c  Charlie  Berlin

In [27]:
#iloc
df.iloc[1]

name      Bob
age        30
city    Paris
Name: b, dtype: object

In [29]:
df.iloc[[0,2]]

      name  age    city
a    Alice   25  London
c  Charlie   35  Berlin